#### Terraform Plan
```
Acquiring state lock. This may take a few moments...
module.apis.google_project_service.compute: Refreshing state... [id=lumios-490217/compute.googleapis.com]
module.apis.google_project_service.cloudtrace: Refreshing state... [id=lumios-490217/cloudtrace.googleapis.com]
module.apis.google_project_service.secretmanager: Refreshing state... [id=lumios-490217/secretmanager.googleapis.com]
module.apis.google_project_service.iam: Refreshing state... [id=lumios-490217/iam.googleapis.com]
module.apis.google_project_service.artifactregistry: Refreshing state... [id=lumios-490217/artifactregistry.googleapis.com]
module.apis.google_project_service.monitoring: Refreshing state... [id=lumios-490217/monitoring.googleapis.com]
module.apis.google_project_service.cloudresourcemanager: Refreshing state... [id=lumios-490217/cloudresourcemanager.googleapis.com]
module.apis.google_project_service.run: Refreshing state... [id=lumios-490217/run.googleapis.com]
module.storage.google_storage_bucket.photos: Refreshing state... [id=lumios-photos-lumios-490217]
module.secrets.google_secret_manager_secret.google_frontend_client_id: Refreshing state... [id=projects/lumios-490217/secrets/lumios-google-frontend-client-id]
module.secrets.google_secret_manager_secret.init_admin_password: Refreshing state... [id=projects/lumios-490217/secrets/lumios-init-admin-password]
module.network.google_compute_network.lumios: Refreshing state... [id=projects/lumios-490217/global/networks/lumios]
module.secrets.google_secret_manager_secret.google_client_id: Refreshing state... [id=projects/lumios-490217/secrets/lumios-google-client-id]
module.secrets.random_password.init_admin_password: Refreshing state... [id=none]
module.secrets.random_password.secret_key: Refreshing state... [id=none]
module.secrets.random_password.jwt_secret: Refreshing state... [id=none]
module.secrets.google_secret_manager_secret.jwt_secret: Refreshing state... [id=projects/lumios-490217/secrets/lumios-jwt-secret]
module.secrets.google_secret_manager_secret.postgres_password: Refreshing state... [id=projects/lumios-490217/secrets/lumios-postgres-password]
module.secrets.google_secret_manager_secret.secret_key: Refreshing state... [id=projects/lumios-490217/secrets/lumios-secret-key]
module.secrets.random_password.postgres: Refreshing state... [id=none]
module.secrets.google_secret_manager_secret.google_client_secret: Refreshing state... [id=projects/lumios-490217/secrets/lumios-google-client-secret]
module.artifact_registry.google_artifact_registry_repository.lumios: Refreshing state... [id=projects/lumios-490217/locations/europe-west1/repositories/lumios]
module.secrets.google_secret_manager_secret_version.jwt_secret: Refreshing state... [id=projects/714378756224/secrets/lumios-jwt-secret/versions/1]
module.secrets.google_secret_manager_secret_version.postgres_password: Refreshing state... [id=projects/714378756224/secrets/lumios-postgres-password/versions/1]
module.secrets.google_secret_manager_secret_version.init_admin_password: Refreshing state... [id=projects/714378756224/secrets/lumios-init-admin-password/versions/1]
module.secrets.google_secret_manager_secret_version.secret_key: Refreshing state... [id=projects/714378756224/secrets/lumios-secret-key/versions/1]
module.network.google_compute_subnetwork.lumios: Refreshing state... [id=projects/lumios-490217/regions/europe-west1/subnetworks/lumios-europe-west1]
module.vm.google_service_account.vm: Refreshing state... [id=projects/lumios-490217/serviceAccounts/lumios-vm@lumios-490217.iam.gserviceaccount.com]
module.vm.google_compute_firewall.allow_iap_ssh: Refreshing state... [id=projects/lumios-490217/global/firewalls/lumios-allow-iap-ssh]
module.vm.google_compute_firewall.allow_db: Refreshing state... [id=projects/lumios-490217/global/firewalls/lumios-allow-db-internal]
module.vm.google_compute_disk.data: Refreshing state... [id=projects/lumios-490217/zones/europe-west1-b/disks/lumios-data]
module.vm.google_secret_manager_secret_iam_member.vm_postgres_password: Refreshing state... [id=projects/lumios-490217/secrets/lumios-postgres-password/roles/secretmanager.secretAccessor/serviceAccount:lumios-vm@lumios-490217.iam.gserviceaccount.com]
module.vm.google_compute_instance.vm: Refreshing state... [id=projects/lumios-490217/zones/europe-west1-b/instances/lumios-vm]
module.cloudrun.data.google_client_openid_userinfo.terraform: Reading...
module.cloudrun.google_service_account.cloudrun: Refreshing state... [id=projects/lumios-490217/serviceAccounts/lumios-cloudrun@lumios-490217.iam.gserviceaccount.com]
module.cloudrun.google_secret_manager_secret.gcs_hmac_secret: Refreshing state... [id=projects/lumios-490217/secrets/lumios-gcs-hmac-secret]
module.cloudrun.google_secret_manager_secret.gcs_hmac_access_key: Refreshing state... [id=projects/lumios-490217/secrets/lumios-gcs-hmac-access-key]
module.cloudrun.google_cloud_run_v2_service.frontend: Refreshing state... [id=projects/lumios-490217/locations/europe-west1/services/lumios-frontend]
module.cloudrun.google_cloud_run_v2_service.landingpage: Refreshing state... [id=projects/lumios-490217/locations/europe-west1/services/lumios-landingpage]
module.cloudrun.google_secret_manager_secret_iam_member.cloudrun_secret_key: Refreshing state... [id=projects/lumios-490217/secrets/lumios-secret-key/roles/secretmanager.secretAccessor/serviceAccount:lumios-cloudrun@lumios-490217.iam.gserviceaccount.com]
module.cloudrun.google_secret_manager_secret_iam_member.cloudrun_postgres_password: Refreshing state... [id=projects/lumios-490217/secrets/lumios-postgres-password/roles/secretmanager.secretAccessor/serviceAccount:lumios-cloudrun@lumios-490217.iam.gserviceaccount.com]
module.cloudrun.google_secret_manager_secret_iam_member.cloudrun_init_admin_password: Refreshing state... [id=projects/lumios-490217/secrets/lumios-init-admin-password/roles/secretmanager.secretAccessor/serviceAccount:lumios-cloudrun@lumios-490217.iam.gserviceaccount.com]
module.cloudrun.google_secret_manager_secret_iam_member.cloudrun_jwt_secret: Refreshing state... [id=projects/lumios-490217/secrets/lumios-jwt-secret/roles/secretmanager.secretAccessor/serviceAccount:lumios-cloudrun@lumios-490217.iam.gserviceaccount.com]
module.cloudrun.google_secret_manager_secret_iam_member.cloudrun_google_client_id: Refreshing state... [id=projects/lumios-490217/secrets/lumios-google-client-id/roles/secretmanager.secretAccessor/serviceAccount:lumios-cloudrun@lumios-490217.iam.gserviceaccount.com]
module.cloudrun.google_secret_manager_secret_iam_member.cloudrun_google_client_secret: Refreshing state... [id=projects/lumios-490217/secrets/lumios-google-client-secret/roles/secretmanager.secretAccessor/serviceAccount:lumios-cloudrun@lumios-490217.iam.gserviceaccount.com]
module.cloudrun.data.google_client_openid_userinfo.terraform: Read complete after 0s [id=terraform@lumios-490217.iam.gserviceaccount.com]
module.cloudrun.google_storage_bucket_iam_member.cloudrun_photos: Refreshing state... [id=b/lumios-photos-lumios-490217/roles/storage.objectAdmin/serviceAccount:lumios-cloudrun@lumios-490217.iam.gserviceaccount.com]
module.cloudrun.google_project_iam_member.cloudrun_trace_agent: Refreshing state... [id=lumios-490217/roles/cloudtrace.agent/serviceAccount:lumios-cloudrun@lumios-490217.iam.gserviceaccount.com]
module.cloudrun.google_secret_manager_secret_iam_member.cloudrun_gcs_hmac_secret: Refreshing state... [id=projects/lumios-490217/secrets/lumios-gcs-hmac-secret/roles/secretmanager.secretAccessor/serviceAccount:lumios-cloudrun@lumios-490217.iam.gserviceaccount.com]
module.cloudrun.google_secret_manager_secret_iam_member.cloudrun_google_frontend_client_id: Refreshing state... [id=projects/lumios-490217/secrets/lumios-google-frontend-client-id/roles/secretmanager.secretAccessor/serviceAccount:lumios-cloudrun@lumios-490217.iam.gserviceaccount.com]
module.cloudrun.google_secret_manager_secret_iam_member.cloudrun_gcs_hmac_access_key: Refreshing state... [id=projects/lumios-490217/secrets/lumios-gcs-hmac-access-key/roles/secretmanager.secretAccessor/serviceAccount:lumios-cloudrun@lumios-490217.iam.gserviceaccount.com]
module.cloudrun.google_cloud_run_v2_service.backend: Refreshing state... [id=projects/lumios-490217/locations/europe-west1/services/lumios-backend]
module.cloudrun.google_cloud_run_v2_service_iam_member.frontend_public: Refreshing state... [id=projects/lumios-490217/locations/europe-west1/services/lumios-frontend/roles/run.invoker/allUsers]
module.cloudrun.google_cloud_run_domain_mapping.frontend: Refreshing state... [id=locations/europe-west1/namespaces/lumios-490217/domainmappings/app.lumios.niecke-it.de]
module.cloudrun.google_cloud_run_v2_service_iam_member.landingpage_public: Refreshing state... [id=projects/lumios-490217/locations/europe-west1/services/lumios-landingpage/roles/run.invoker/allUsers]
module.cloudrun.google_cloud_run_domain_mapping.landingpage: Refreshing state... [id=locations/europe-west1/namespaces/lumios-490217/domainmappings/lumios.niecke-it.de]
module.cloudrun.google_cloud_run_v2_service_iam_member.public: Refreshing state... [id=projects/lumios-490217/locations/europe-west1/services/lumios-backend/roles/run.invoker/allUsers]
module.cloudrun.google_cloud_run_domain_mapping.backend: Refreshing state... [id=locations/europe-west1/namespaces/lumios-490217/domainmappings/backend.lumios.niecke-it.de]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.cloudrun.google_cloud_run_v2_service.frontend will be updated in-place
  ~ resource "google_cloud_run_v2_service" "frontend" {
        id                      = "projects/lumios-490217/locations/europe-west1/services/lumios-frontend"
        name                    = "lumios-frontend"
        # (35 unchanged attributes hidden)

      ~ template {
            # (11 unchanged attributes hidden)

          ~ containers {
                name           = null
                # (7 unchanged attributes hidden)

              + env {
                  + name  = "BACKEND_HOST"
                  + value = "backend.lumios.niecke-it.de"
                }

                # (4 unchanged blocks hidden)
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.cloudrun.google_cloud_run_v2_service.landingpage will be updated in-place
  ~ resource "google_cloud_run_v2_service" "landingpage" {
      - client                  = "gcloud" -> null
      - client_version          = "559.0.0" -> null
        id                      = "projects/lumios-490217/locations/europe-west1/services/lumios-landingpage"
        name                    = "lumios-landingpage"
        # (33 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.monitoring.google_monitoring_alert_policy.backend_uptime will be created
  + resource "google_monitoring_alert_policy" "backend_uptime" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "Lumios Backend Uptime Alert"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = (known after apply)
      + notification_channels = (known after apply)
      + project               = "lumios-490217"

      + alert_strategy {
          + auto_close = "1800s"
        }

      + conditions {
          + display_name = "Backend uptime check failing"
          + name         = (known after apply)

          + condition_threshold {
              + comparison      = "COMPARISON_GT"
              + duration        = "300s"
              + filter          = (known after apply)
              + threshold_value = 1

              + aggregations {
                  + alignment_period     = "1200s"
                  + cross_series_reducer = "REDUCE_COUNT_FALSE"
                  + group_by_fields      = [
                      + "resource.label.project_id",
                    ]
                  + per_series_aligner   = "ALIGN_NEXT_OLDER"
                }

              + trigger {
                  + count = 1
                }
            }
        }
    }

  # module.monitoring.google_monitoring_alert_policy.frontend_uptime will be created
  + resource "google_monitoring_alert_policy" "frontend_uptime" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "Lumios Frontend Uptime Alert"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = (known after apply)
      + notification_channels = (known after apply)
      + project               = "lumios-490217"

      + alert_strategy {
          + auto_close = "1800s"
        }

      + conditions {
          + display_name = "Frontend uptime check failing"
          + name         = (known after apply)

          + condition_threshold {
              + comparison      = "COMPARISON_GT"
              + duration        = "300s"
              + filter          = (known after apply)
              + threshold_value = 1

              + aggregations {
                  + alignment_period     = "1200s"
                  + cross_series_reducer = "REDUCE_COUNT_FALSE"
                  + group_by_fields      = [
                      + "resource.label.project_id",
                    ]
                  + per_series_aligner   = "ALIGN_NEXT_OLDER"
                }

              + trigger {
                  + count = 1
                }
            }
        }
    }

  # module.monitoring.google_monitoring_alert_policy.landingpage_uptime will be created
  + resource "google_monitoring_alert_policy" "landingpage_uptime" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "Lumios Landing Page Uptime Alert"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = (known after apply)
      + notification_channels = (known after apply)
      + project               = "lumios-490217"

      + alert_strategy {
          + auto_close = "1800s"
        }

      + conditions {
          + display_name = "Landing page uptime check failing"
          + name         = (known after apply)

          + condition_threshold {
              + comparison      = "COMPARISON_GT"
              + duration        = "300s"
              + filter          = (known after apply)
              + threshold_value = 1

              + aggregations {
                  + alignment_period     = "1200s"
                  + cross_series_reducer = "REDUCE_COUNT_FALSE"
                  + group_by_fields      = [
                      + "resource.label.project_id",
                    ]
                  + per_series_aligner   = "ALIGN_NEXT_OLDER"
                }

              + trigger {
                  + count = 1
                }
            }
        }
    }

  # module.monitoring.google_monitoring_notification_channel.email will be created
  + resource "google_monitoring_notification_channel" "email" {
      + display_name        = "Lumios Alert Email"
      + enabled             = true
      + force_delete        = false
      + id                  = (known after apply)
      + labels              = {
          + "email_address" = "daniel@niecke-it.de"
        }
      + name                = (known after apply)
      + project             = "lumios-490217"
      + type                = "email"
      + verification_status = (known after apply)
    }

  # module.monitoring.google_monitoring_uptime_check_config.backend will be created
  + resource "google_monitoring_uptime_check_config" "backend" {
      + checker_type     = (known after apply)
      + display_name     = "Lumios Backend Health Check"
      + id               = (known after apply)
      + name             = (known after apply)
      + period           = "300s"
      + project          = "lumios-490217"
      + selected_regions = [
          + "EUROPE",
        ]
      + timeout          = "10s"
      + uptime_check_id  = (known after apply)

      + http_check {
          + headers        = (known after apply)
          + path           = "/health"
          + port           = 443
          + request_method = "GET"
          + use_ssl        = true
          + validate_ssl   = true
        }

      + monitored_resource {
          + labels = {
              + "host"       = "backend.lumios.niecke-it.de"
              + "project_id" = "lumios-490217"
            }
          + type   = "uptime_url"
        }
    }

  # module.monitoring.google_monitoring_uptime_check_config.frontend will be created
  + resource "google_monitoring_uptime_check_config" "frontend" {
      + checker_type     = (known after apply)
      + display_name     = "Lumios Frontend Uptime Check"
      + id               = (known after apply)
      + name             = (known after apply)
      + period           = "300s"
      + project          = "lumios-490217"
      + selected_regions = [
          + "EUROPE",
        ]
      + timeout          = "10s"
      + uptime_check_id  = (known after apply)

      + http_check {
          + headers        = (known after apply)
          + path           = "/"
          + port           = 443
          + request_method = "GET"
          + use_ssl        = true
          + validate_ssl   = true
        }

      + monitored_resource {
          + labels = {
              + "host"       = "app.lumios.niecke-it.de"
              + "project_id" = "lumios-490217"
            }
          + type   = "uptime_url"
        }
    }

  # module.monitoring.google_monitoring_uptime_check_config.landingpage will be created
  + resource "google_monitoring_uptime_check_config" "landingpage" {
      + checker_type     = (known after apply)
      + display_name     = "Lumios Landing Page Uptime Check"
      + id               = (known after apply)
      + name             = (known after apply)
      + period           = "300s"
      + project          = "lumios-490217"
      + selected_regions = [
          + "EUROPE",
        ]
      + timeout          = "10s"
      + uptime_check_id  = (known after apply)

      + http_check {
          + headers        = (known after apply)
          + path           = "/"
          + port           = 443
          + request_method = "GET"
          + use_ssl        = true
          + validate_ssl   = true
        }

      + monitored_resource {
          + labels = {
              + "host"       = "lumios.niecke-it.de"
              + "project_id" = "lumios-490217"
            }
          + type   = "uptime_url"
        }
    }

Plan: 7 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```